#+PROPERTY: header-args :results none

Defining a minor mode and getting nuts with order of evaluation.

The documentation gave an example but it was not obvious how to adapt it to a
form using =(kbd "C-c . x")= to specify the key sequences.

Using System Crafter's stuff, I was able to get a few working examples.  My
favorite one is this one which demonstrates an understanding of what the
macro requires and using =`= and =,= to provide the right things.

#+begin_src emacs-lisp
(define-minor-mode phil-mode-synthesis-1
  "A minor mode by Phil"
  nil
  :keymap `((,(kbd "C-c . m")
            . (lambda () (interactive) (message "The key 'C-c . m' was pressed asdf")))
           ([3 ?. ?b]
            . ,(lambda () (interactive) (message "The key 'C-c . b' was pressed")))))
#+end_src

*** From the one that works

#+begin_src emacs-lisp
(list
 (cons (kbd "C-c . n")
       (lambda () (interactive) (message "The key 'C-c . n' was pressed"))))
#+end_src

#+RESULTS:
((.n lambda nil (interactive) (message The key 'C-c . n' was pressed)))

We see that the =(kbd "C-c . n")= form was evaluated to produce a plain sequence
of keycodes.

*** From the one that doesn't work


#+begin_src emacs-lisp
'(
  ((kbd "C-c . u")
   . (lambda () (interactive) (message "The key 'C-c . u' was pressed"))))
#+end_src

#+RESULTS:
(((kbd C-c . u) lambda nil (interactive) (message The key 'C-c . u' was pressed)))

*** Testing my understanding

#+begin_src emacs-lisp
`(
  (,(kbd "C-c . u")
   . (lambda () (interactive) (message "The key 'C-c . u' was pressed")))
  ([3 ?. ?b]
   . (lambda () (interactive) (message "The key 'C-c . b' was pressed"))))
#+end_src

#+RESULTS:
((.u lambda nil (interactive) (message The key 'C-c . u' was pressed)))

In the wrong examples we wanted to use =(kbd)= to create key sequences because
it's more practical.  However, ='(( (kbd "...") . (lambda ...) ))= creates a
list with one cons cell whose first elemnt is the list =(kbd "...")=.

Somehow the =define-minor-mode= macro doesn't evaluate =(kbd "...")= and instead
looks ends up using the "C-c . m" as an actual sequence of keys like =[?C ?-
Space ?. Space ?m]=.  The macro passes the keyword argument to
=easy-mmode-define-keymap= which then does

#+begin_src emacs-lisp
(define-minor-mode phil-mode-synthesis-1
  "A minor mode by Phil"
  nil
  :keymap `(
           (,(kbd "C-c . m")
            . (lambda () (interactive) (message "The key 'C-c . m' was pressed asdf")))
           ([3 ?. ?b]
            . ,(lambda () (interactive) (message "The key 'C-c . b' was pressed")))
))
#+end_src

#+begin_src emacs-lisp :results none
(define-minor-mode phil-mode-synthesis
  "A minor mode by Phil"
  nil
  :keymap (list
           (cons (kbd "C-c . m") (lambda () (interactive) (message "The key 'C-c . m' was pressed piss ass")))
           (cons [3 ?. ?b] (lambda () (interactive) (message "The key 'C-c . b' was pressed")))
))
#+end_src

*** Unevaluated ='(kbd "x y z")=
We see that the =(kbd "C-c . C-u")= did not get evaluated.  When eventually
=easy-mmode-define-keymap= uses it, there is some dynamic type checking
#+begin_src emacs-lisp
(let ((keys '(kbd "C-c . m"))
      (binding '(lambda (x) (message "lambdax:%s" x))))
  (dolist (key (if (consp keys) keys (list keys)))
    (progn (message "Iteration: key=[%s]" key)
    (cond
     ((symbolp key)
      (message "substitute-key-definition key[%s] binding m global-map" key))
     ((null binding)
      (message "unless (keymapp (lookup-key m key[%s])) (define-key m key[%s] binding))" key key))
	   (t ;; (let ((o (lookup-key m key))) (or (null o) (numberp o) (eq o 'undefined)))
	    (message "(define-key m key[%s] binding)" key)))))))
#+end_src

#+RESULTS:
nil

#+begin_example
Executing Emacs-Lisp code block at position 5511...
Iteration: key=[kbd]
substitute-key-definition key[kbd] binding m global-map
Iteration: key=[C-c . m]
(define-key m key[C-c . m] binding)
Code block evaluation complete.
#+end_example

